In [1]:
import pandas as pd

import datetime 
import ast
import json

In [2]:
# Para poder ver el contenido de todo el ancho de la columna
pd.set_option('display.max_colwidth', None)

In [3]:
##Leo el csv que cree previamente a partir del DS original y que llame Collections
dfcollect= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\CSVNUEVOS\Collections.csv', sep=',')
dfcollect.head()

,id,belongs_to_collection
0,862,"{'id': 10194, 'name': 'Toy Story Collection', 'poster_path': '/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg', 'backdrop_path': '/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}"
1,8844,NaN
2,15602,"{'id': 119050, 'name': 'Grumpy Old Men Collection', 'poster_path': '/nLvUdqgPgm3F85NMCii9gVFUcet.jpg', 'backdrop_path': '/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg'}"
3,31357,NaN
4,11862,"{'id': 96871, 'name': 'Father of the Bride Collection', 'poster_path': '/nts4iOmNnq7GNicycMJ9pSAn204.jpg', 'backdrop_path': '/7qwE57OVZmMJChBpLEbJEmzUydk.jpg'}"

In [4]:
##elimino los nulos
dfcollect.dropna(inplace=True)

In [5]:
##me fijo cuantas filas me quedan, eso quiere decir que no todas las peliculas tienen coleccion
dfcollect.shape

(4466, 2)

In [6]:
"""Para desanidar el diccionario en key y value creo una funcion.
Esta funcion se aplica a un diccionario, recibe dos parametros y devuelve el valor asociado 
 por cada clave en el mismo. En el caso de que el tipo de dato no sea dict y sea str lo convierte 
 antes de extraer el valor. Una vez que el tipo de dato es dict devuelve la clave asociada a cada valor con get. 
 Devuelve None si el valor es nulo o si el valor no es ninguno de los anteriores."""
def obtener_valor(diccionario, clave):
    if pd.isnull(diccionario):
        return None
    if not isinstance(diccionario, dict):
        try:
            diccionario = json.loads(diccionario.replace("'", "\""))
        except (json.JSONDecodeError, AttributeError):
            return None
    if isinstance(diccionario, dict):
        return diccionario.get(clave)
    else:
        return None

In [7]:
# Aplico la funcion a la columna belong_to_collection y creo una
dfcollect['ID'] = dfcollect['belongs_to_collection'].apply(lambda x: obtener_valor(x, 'id'))
dfcollect['NAME'] = dfcollect['belongs_to_collection'].apply(lambda x: obtener_valor(x, 'name'))
dfcollect['POSTER'] = dfcollect['belongs_to_collection'].apply(lambda x: obtener_valor(x, 'poster_path'))
dfcollect['BACKDROP'] = dfcollect['belongs_to_collection'].apply(lambda x: obtener_valor(x, 'backdrop_path'))

In [8]:
dfcollect.head()

,id,belongs_to_collection,ID,NAME,POSTER,BACKDROP
0,862,"{'id': 10194, 'name': 'Toy Story Collection', 'poster_path': '/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg', 'backdrop_path': '/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg'}",10194.0,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
2,15602,"{'id': 119050, 'name': 'Grumpy Old Men Collection', 'poster_path': '/nLvUdqgPgm3F85NMCii9gVFUcet.jpg', 'backdrop_path': '/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg'}",119050.0,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg
4,11862,"{'id': 96871, 'name': 'Father of the Bride Collection', 'poster_path': '/nts4iOmNnq7GNicycMJ9pSAn204.jpg', 'backdrop_path': '/7qwE57OVZmMJChBpLEbJEmzUydk.jpg'}",96871.0,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg
9,710,"{'id': 645, 'name': 'James Bond Collection', 'poster_path': '/HORpg5CSkmeQlAolx3bKMrKgfi.jpg', 'backdrop_path': '/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg'}",645.0,James Bond Collection,/HORpg5CSkmeQlAolx3bKMrKgfi.jpg,/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg
12,21032,"{'id': 117693, 'name': 'Balto Collection', 'poster_path': '/w0ZgH6Lgxt2bQYnf1ss74UvYftm.jpg', 'backdrop_path': '/9VM5LiJV0bGb1st1KyHA3cVnO2G.jpg'}",117693.0,Balto Collection,/w0ZgH6Lgxt2bQYnf1ss74UvYftm.jpg,/9VM5LiJV0bGb1st1KyHA3cVnO2G.jpg

In [9]:
# elimino columnas y me quedo unicamente con nombre de la franquicia y con id de pelicula
columnas_a_eliminar = ['belongs_to_collection', 'POSTER', 'BACKDROP', 'ID']
dfcollect2= dfcollect.drop(columns=columnas_a_eliminar)
dfcollect2.head()

       id                            NAME
0     862            Toy Story Collection
2   15602       Grumpy Old Men Collection
4   11862  Father of the Bride Collection
9     710           James Bond Collection
12  21032                Balto Collection

In [10]:
dfcollect2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4466 entries, 0 to 44855
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4466 non-null   int64
 1   NAME    3153 non-null   object
dtypes: int64(1), object(1)
memory usage: 104.7+ KB

In [11]:
#me fijo cuantos nulos hay
dfcollect2.isnull().value_counts()

id     NAME
False  False    3153
       True     1313
dtype: int64

In [12]:
dfcollect2.tail(10)

           id                          NAME
44733  417320                          None
44777   78359        Mister Blot Collection
44789  152912        Mister Blot Collection
44816  248705       The Visitors Collection
44826    3104  Frankenstein (Hammer Series)
44828   24568       The Carry On Collection
44831   19307       The Carry On Collection
44842   21251       The Carry On Collection
44844  460135                          None
44855  182030          Red Lotus Collection

In [13]:
## Genero un csv con id de pelicula y collection
dfcollect2.to_csv('CollectionsFinal.csv', index=False)

In [14]:
### son 4466 filas pero igual hay nulos...despues agrupando se van
dfcollect2.shape

(4466, 2)

In [15]:
## al ver la funcion que me pide de FRANQUICIAS, decido generar un nuevo DF a partir de datos que ya limpie

In [16]:
#me traigo el de movies que limpie al inicio del ETL 
movies= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\A-ETLconsignas\MoviesSMALL.csv')

In [17]:
# Dejo unicamente las columnas que voy a usar para la funcion de FRANQUICIA
movies2= movies[['id','revenue']]
movies2.head()

      id      revenue
0    862  373554033.0
1   8844  262797249.0
2  15602          0.0
3  31357   81452156.0
4  11862   76578911.0

In [18]:
movies2.shape

(44936, 2)

In [19]:
# Combinar DF de collection con el de MOVIES en un solo DataFrame basado en la columna id
franquicia = pd.merge(dfcollect2, movies2, on='id', how='left')

franquicia.head()

      id                            NAME      revenue
0    862            Toy Story Collection  373554033.0
1  15602       Grumpy Old Men Collection          0.0
2  11862  Father of the Bride Collection   76578911.0
3    710           James Bond Collection  352194034.0
4  21032                Balto Collection   11348324.0

In [20]:
franquicia.shape

(4472, 3)

In [21]:
## Ahora uso la funcion groupby para agrupar la cantidad de peliculas por nombre de Coleccion
cantidad= franquicia[['id','NAME']].groupby('NAME').count().reset_index()

In [22]:
## Ahora uso la funcion groupby para agrupar la suma de revenue por Coleccion
ganancia= franquicia[['revenue','NAME']].groupby('NAME').sum().reset_index()

In [23]:
## Ahora uso la funcion groupby para agrupar el promedio de revenue por Coleccion
promedio= franquicia[['revenue','NAME']].groupby('NAME').mean().reset_index()

In [24]:
# Uno los 3 df que arme arriba a partir de la columna en comun NAME
#primero uno dos y creo uno
merged_df1 = pd.merge(cantidad, ganancia, on='NAME', how='left')

# Luego uno el resultado anterior (merged_df1) con promedio en base a la columna NAME
merged_df2 = pd.merge(merged_df1, promedio, on='NAME', how='left')


merged_df2.head()

                                      NAME  id    revenue_x    revenue_y
0                ... Has Fallen Collection   2  366780087.0  183390043.5
1                   00 Schneider Filmreihe   1          0.0          0.0
2                     100 Girls Collection   2          0.0          0.0
3     101 Dalmatians (Animated) Collection   2  215880014.0  107940007.0
4  101 Dalmatians (Live-Action) Collection   2  504301065.0  252150532.5

In [25]:
merged_df2.shape

(1077, 4)

In [30]:
merged_df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1077 entries, 0 to 1076
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   NAME       1077 non-null   object
 1   id         1077 non-null   float64
 2   revenue_x  1077 non-null   float64
 3   revenue_y  1077 non-null   float64
dtypes: float64(3), object(1)
memory usage: 42.1+ KB

In [29]:
#lo transformo a float porque sino me da error en render
merged_df2['id'] = merged_df2['id'].astype(float)

In [31]:
merged_df2.to_csv('Franquicias.csv', index=False)